///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////





//-------------------------------------------------------------------------------------------------------------------//




//- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -//


const name: string = 'alpha';

function sum(a: number, b: number) {

    return a + b;
}

export default function () {

    console.log('[module_commonjs]');
};


//-------------------------------------------------------------------------------------------------------------------//


/**
 * 若要使用 commonjs，不要使用 module.exports
 * 因为这样导出 ts 无法在引入该模块时类型检查
 *
 *
 ** 依然可以使用 es6_modules 的形式导出( 使用 commonjs 编译时，ts 内部会处理 )
 */

// module.exports = {
//
//     name,
//     sum,
// };


/** 无论使用 es6_module & commonjs，都要使用 es6_module 形式导出，否则在倒入时无法类型检查 **/
export {

    name,
    sum,
}


///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
